Repository: okfde/django-flowcontrol
Catalog: flowcontrol/locale/*/LC_MESSAGES/django.po
Languages: de

source: Control flow
de: Kontrollfluss

source: If Condition
de: Wenn-Bedingung

source: This action runs a block of actions if a condition is true.
de: Diese Aktion durchläuft ihre untergeordneten Aktionen, wenn eine Bedingung zutrifft.

source: While Loop
de: Bedingungs-Schleife

source: This action runs a block of actions while a condition is true.
de: Diese Aktion durchläuft ihre untergeordneten Aktionen, solange eine Bedingung zutrifft.

source: Delay
de: Pause

source: This action suspends the flow for some time.
de: Diese Aktion hält den Ablauf für einige Zeit an.

source: Start new flow
de: Neuen Ablauf starten

source: This action starts another flow.
de: Diese Aktion startet einen weiteren Ablauf.

source: Set state
de: Zustand festlegen

source: Replace run state.
de: Ersetze den Ablaufszustand.

source: State manipulation
de: Zustand verändern

source: Update state
de: Zustand aktualisieren

source: Update run state.
de: Aktualisiere den Ablaufszustand.

source: For Loop
de: Zählschleife

source: Loop with a number of times.
de: Schleife Anzahl an Ausführungen.

source: Return to parent action
de: Zurück zur übergeordneten Aktion

source: This action returns control to the parent action.
de: Diese Aktion setzt die Ausführung mit der übergeordneten Aktion fort.

source: Leave branch
de: Abzweigung verlassen

source: This action moves control to the parent action's next sibling.
de: Diese Aktion führt den Ablauf mit der Aktion weiter, die nach der übergeordneten Aktion folgt.

source: Stop Flow
de: Ablauf stoppen

source: This action stops the flow.
de: Diese Aktion stoppt den Ablauf.

source: Actions
de: Aktionen

source: Edit Actions
de: Aktionen bearbeiten

source: Active
de: Aktiv

source: Activate selected flows
de: Ausgewählte Abläufe aktivieren

source: Deactivate selected flows
de: Ausgewählte Abläufe deaktivieren

source: Duplicate selected flows
de: Ausgewählte Abläufe duplizieren

source: Flow
de: Ablauf

source: The flow to which the action will be added.
de: Der Ablauf, zu der die Aktion hinzugefügt wird.

source: Action Type
de: Aktionstyp

source: Select the type of action to add to the flow.
de: Wähle die Art der Aktion aus, die zum Ablauf hinzugefügt werden soll.

source: Action
de: Aktion

source: Description
de: Beschreibung

source: Configuration
de: Konfiguration

source: Runs waiting on this action
de: Instanzen, die bei dieser Aktion warten

source: Duplicate selected actions
de: Dupliziere die ausgewählten Aktionen

source: Choose action to add to flow '{flow}'
de: Wähle Aktion, die zum Ablauf '{flow}' hinzugefügt werden soll

source: Add '{action}' action to flow '{flow}'
de: Füge '{action}’-Aktion zum Ablauf '{flow}' hinzu

source: Content Object
de: Inhalts-Objekt

source: Execute selected flow runs
de: Führe ausgewählte Ablaufinstanzen aus

source: Trigger
de: Auslöser

source: Base Action
de: Basis-Aktion

source: This is a base action class that should be extended.
de: Dies ist die Basisklasse für Aktionen, die erweitert werden soll.

source: Monday
de: Montag

source: Tuesday
de: Dienstag

source: Wednesday
de: Mittwoch

source: Thursday
de: Donnerstag

source: Friday
de: Freitag

source: Saturday
de: Samstag

source: Sunday
de: Sonntag

source: Base Date Template
de: Basis-Datumsvorlage

source: Template expression from which the delay will be calculated, defaults to time of invocation.
de: Template-Ausdruck von dem aus die Pause berechnet wird, standardmäßig der Zeitpunkt der Ausführung.

source: Delay for number of months
de: Diese Anzahl von Monaten pausieren

source: Number of months to delay before proceeding to the next action.
de: Anzahl der Monate die gewartet werden soll, bis die nächste Aktion ausgeführt wird.

source: Delay Until this weekday
de: Bis zu diesem Wochentag pausieren

source: Only continue after reaching this time.
de: Ausführung wird erst nach dieser Zeit fortgesetzt.

source: Continue from now
de: Weiter von jetzt an

source: Return to parent
de: Zurück zur übergeordneten Aktion

source: Break to next parent's sibling
de: Weiter mit Aktion nach der übergeordneten Aktion

source: Abort run
de: Ablauf abbrechen

source: Action if past delay
de: Aktion, falls schon nach der Pause

source: What to do if the delay is already past when the action is executed.
de: Was passieren soll, wenn der verzögerte Zeitpunkt schon in der Vergangenheit liegt, wenn die Aktion ausgeführt wird.

source: after {months} month(s)
de: nach {months} Monat(en)

source: on {weekday}
de: am {weekday}

source: at {time}
de: um {time}

source: No delay set.
de: Keine Pause angegeben.

source: Flow Name
de: Ablaufsname

source: Name of the flow
de: Name des Ablaufs

source: Description of the flow
de: Beschreibung des Ablaufs

source: Created At
de: Erstellt am

source: Updated At
de: Aktualisiert am

source: Active Since
de: Aktiv seit

source: Max Concurrent Runs
de: Maximale gleichzeitige Ausführungen

source: Flows
de: Abläufe

source: Optional documentation for this action.
de: Optionale Dokumentation für diese Aktion.

source: Action Name
de: Aktionsname

source: Name of the action to be performed
de: Name der Aktion, die ausgeführt werden soll

source: Flow Action
de: Ablaufaktion

source: Flow Actions
de: Ablaufaktionen

source: Pending
de: Läuft

source: Running
de: Wird ausgeführt

source: Waiting
de: Wartet

source: Paused
de: Pausiert

source: done
de: abgeschlossen

source: Complete
de: Abgeschlossen

source: Aborted
de: Abgebrochen

source: Errored
de: Fehlgeschlagen

source: Obsolete
de: Obsolet

source: Canceled
de: Annulliert

source: Parent Run
de: Übergeordneter Ablauf

source: Created by trigger
de: Erstellt durch Auslöser

source: Execute action again on resume
de: Führe Aktion noch einmal beim Wiederaufruf aus

source: Outcome
de: Ergebnis

source: Log
de: Protokoll

source: Continue After
de: Weiter nach

source: Completed At
de: Abgeschlossen am

source: State
de: Zustand

source: Flow Run
de: Ablaufinstanz

source: Flow Runs
de: Ablaufinstanzen

source: Action does not belong to the flow.
de: Aktion gehört nicht zum Ablauf.

source: Trigger Name
de: Auslösername

source: Name of the trigger to listen for
de: Name des Auslösers, auf den gewartet wird

source: The time when this trigger starts being active
de: Die Zeit, wenn dieser Auslöser aktiv wird

source: Flow Trigger
de: Ablaufauslöser

source: Flow Triggers
de: Ablaufauslöser

source: Edit actions
de: Bearbeite Aktion

source: Next
de: Weiter

source: Add action to flow
de: Füge Aktion zu Ablauf hinzu

source: Home
de: Start

source: {num} second
de: {num} Sekunde
